; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-3nodes-1000size-4degree-100mindistance-3trucks-6packages-1006seed

(define (problem transport-three-cities-sequential-3nodes-1000size-4degree-100mindistance-3trucks-6packages-1006seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  package-6 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 234,454 -> 354,57
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 42)
  ; 354,57 -> 234,454
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 42)
  ; 12,210 -> 354,57
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 38)
  ; 354,57 -> 12,210
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 38)
  ; 12,210 -> 234,454
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 33)
  ; 234,454 -> 12,210
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 33)
  ; 2330,675 -> 2953,591
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 63)
  ; 2953,591 -> 2330,675
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 63)
  ; 2000,784 -> 2330,675
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 35)
  ; 2330,675 -> 2000,784
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 35)
  ; 1530,2915 -> 1214,2920
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 32)
  ; 1214,2920 -> 1530,2915
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 32)
  ; 1781,2316 -> 1530,2915
  (road city-3-loc-3 city-3-loc-2)
  (= (road-length city-3-loc-3 city-3-loc-2) 65)
  ; 1530,2915 -> 1781,2316
  (road city-3-loc-2 city-3-loc-3)
  (= (road-length city-3-loc-2 city-3-loc-3) 65)
  ; 234,454 <-> 2000,784
  (road city-1-loc-2 city-2-loc-3)
  (= (road-length city-1-loc-2 city-2-loc-3) 180)
  (road city-2-loc-3 city-1-loc-2)
  (= (road-length city-2-loc-3 city-1-loc-2) 180)
  (road city-1-loc-2 city-3-loc-2)
  (= (road-length city-1-loc-2 city-3-loc-2) 211)
  (road city-3-loc-2 city-1-loc-2)
  (= (road-length city-3-loc-2 city-1-loc-2) 211)
  (road city-2-loc-3 city-3-loc-3)
  (= (road-length city-2-loc-3 city-3-loc-3) 207)
  (road city-3-loc-3 city-2-loc-3)
  (= (road-length city-3-loc-3 city-2-loc-3) 207)
  (at package-1 city-3-loc-1)
  (at package-2 city-3-loc-1)
  (at package-3 city-2-loc-1)
  (at package-4 city-2-loc-1)
  (at package-5 city-2-loc-1)
  (at package-6 city-2-loc-3)
  (at truck-1 city-3-loc-1)
  (capacity truck-1 capacity-2)
  (at truck-2 city-2-loc-2)
  (capacity truck-2 capacity-2)
  (at truck-3 city-1-loc-3)
  (capacity truck-3 capacity-3)
 )
 (:goal (and
  (at package-1 city-1-loc-2)
  (at package-2 city-2-loc-2)
  (at package-3 city-2-loc-2)
  (at package-4 city-3-loc-2)
  (at package-5 city-3-loc-3)
  (at package-6 city-3-loc-1)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-3 city-1-loc-3 city-1-loc-2)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-1-loc-2)
   goals met: 0 of 6
2. (drive truck-3 city-1-loc-2 city-2-loc-3)
   deleted: (at truck-3 city-1-loc-2)
   added: (at truck-3 city-2-loc-3)
   goals met: 0 of 6
3. (drive truck-3 city-2-loc-3 city-2-loc-2)
   deleted: (at truck-3 city-2-loc-3)
   added: (at truck-3 city-2-loc-2)
   goals met: 0 of 6
4. (drive truck-3 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-3 city-2-loc-2)
   added: (at truck-3 city-2-loc-1)
   goals met: 0 of 6
5. (pick-up truck-3 city-2-loc-1 package-5 capacity-2 capacity-3)
   deleted: (at package-5 city-2-loc-1) (capacity truck-3 capacity-3)
   added: (in package-5 truck-3) (capacity truck-3 capacity-2)
   goals met: 0 of 6
6. (pick-up truck-3 city-2-loc-1 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-2-loc-1) (capacity truck-3 capacity-2)
   added: (in package-4 truck-3) (capacity truck-3 capacity-1)
   goals met: 0 of 6
7. (pick-up truck-3 city-2-loc-1 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-2-loc-1) (capacity truck-3 capacity-1)
   added: (in package-3 truck-3) (capacity truck-3 capacity-0)
   goals met: 0 of 6
8. (drive truck-3 city-2-loc-1 city-2-loc-2)
   deleted: (at truck-3 city-2-loc-1)
   added: (at truck-3 city-2-loc-2)
   goals met: 0 of 6
9. (drop truck-3 city-2-loc-2 package-3 capacity-0 capacity-1)
   deleted: (in package-3 truck-3) (capacity truck-3 capacity-0)
   added: (at package-3 city-2-loc-2) (capacity truck-3 capacity-1)
   goals met: 1 of 6
10. (drive truck-3 city-2-loc-2 city-2-loc-3)
   deleted: (at truck-3 city-2-loc-2)
   added: (at truck-3 city-2-loc-3)
   goals met: 1 of 6
11. (pick-up truck-3 city-2-loc-3 package-6 capacity-0 capacity-1)
   deleted: (at package-6 city-2-loc-3) (capacity truck-3 capacity-1)
   added: (in package-6 truck-3) (capacity truck-3 capacity-0)
   goals met: 1 of 6
12. (pick-up truck-1 city-3-loc-1 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-3-loc-1) (capacity truck-1 capacity-2)
   added: (in package-2 truck-1) (capacity truck-1 capacity-1)
   goals met: 1 of 6
13. (pick-up truck-1 city-3-loc-1 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-3-loc-1) (capacity truck-1 capacity-1)
   added: (in package-1 truck-1) (capacity truck-1 capacity-0)
   goals met: 1 of 6
14. (drive truck-1 city-3-loc-1 city-3-loc-2)
   deleted: (at truck-1 city-3-loc-1)
   added: (at truck-1 city-3-loc-2)
   goals met: 1 of 6
15. (drive truck-1 city-3-loc-2 city-1-loc-2)
   deleted: (at truck-1 city-3-loc-2)
   added: (at truck-1 city-1-loc-2)
   goals met: 1 of 6
16. (drop truck-1 city-1-loc-2 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-0)
   added: (at package-1 city-1-loc-2) (capacity truck-1 capacity-1)
   goals met: 2 of 6
17. (drive truck-3 city-2-loc-3 city-3-loc-3)
   deleted: (at truck-3 city-2-loc-3)
   added: (at truck-3 city-3-loc-3)
   goals met: 2 of 6
18. (drive truck-1 city-1-loc-2 city-2-loc-3)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-2-loc-3)
   goals met: 2 of 6
19. (drive truck-1 city-2-loc-3 city-2-loc-2)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-2)
   goals met: 2 of 6
20. (drop truck-1 city-2-loc-2 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-1)
   added: (at package-2 city-2-loc-2) (capacity truck-1 capacity-2)
   goals met: 3 of 6
21. (drop truck-3 city-3-loc-3 package-5 capacity-0 capacity-1)
   deleted: (in package-5 truck-3) (capacity truck-3 capacity-0)
   added: (at package-5 city-3-loc-3) (capacity truck-3 capacity-1)
   goals met: 4 of 6
22. (drive truck-3 city-3-loc-3 city-3-loc-2)
   deleted: (at truck-3 city-3-loc-3)
   added: (at truck-3 city-3-loc-2)
   goals met: 4 of 6
23. (drop truck-3 city-3-loc-2 package-4 capacity-1 capacity-2)
   deleted: (in package-4 truck-3) (capacity truck-3 capacity-1)
   added: (at package-4 city-3-loc-2) (capacity truck-3 capacity-2)
   goals met: 5 of 6
24. (drive truck-3 city-3-loc-2 city-3-loc-1)
   deleted: (at truck-3 city-3-loc-2)
   added: (at truck-3 city-3-loc-1)
   goals met: 5 of 6
25. (drop truck-3 city-3-loc-1 package-6 capacity-2 capacity-3)
   deleted: (in package-6 truck-3) (capacity truck-3 capacity-2)
   added: (at package-6 city-3-loc-1) (capacity truck-3 capacity-3)
   goals met: 6 of 6
